In [3]:
#importing libraries
import pandas as pd
import numpy as np

In [5]:
#creating dict and dataframe
dict = {'Name': ["Alice","bob","Charlie","David"],
        'Age' : [24,27,22,32],
        'city' : ['New York', 'Los Angeles', 'Chicago', 'Houston']}
df = pd.DataFrame(dict)
df

      Name  Age         city
0    Alice   24     New York
1      bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [7]:
#displaying first two values
df.head(2)

    Name  Age         city
0  Alice   24     New York
1    bob   27  Los Angeles

In [9]:
#displaying only columns
df[['Name','city']]

      Name         city
0    Alice     New York
1      bob  Los Angeles
2  Charlie      Chicago
3    David      Houston

In [11]:
#adding column
salary = [50000,60000,45000,52000]
df['Salary'] = salary
df

      Name  Age         city  Salary
0    Alice   24     New York   50000
1      bob   27  Los Angeles   60000
2  Charlie   22      Chicago   45000
3    David   32      Houston   52000

In [13]:
#filtering using condition
df[df['Age']>25]

    Name  Age         city  Salary
1    bob   27  Los Angeles   60000
3  David   32      Houston   52000

In [15]:
#filtering using condition
df[df['city'] == 'Chicago']

      Name  Age     city  Salary
2  Charlie   22  Chicago   45000

In [17]:
#updating 
df.loc[df['Name'] == 'bob' , 'Salary' ] = 65000
df

      Name  Age         city  Salary
0    Alice   24     New York   50000
1      bob   27  Los Angeles   65000
2  Charlie   22      Chicago   45000
3    David   32      Houston   52000

In [20]:
#deleting column
drop = df.drop(['city'],axis =1)
drop

      Name  Age  Salary
0    Alice   24   50000
1      bob   27   65000
2  Charlie   22   45000
3    David   32   52000

In [22]:
#Finding average and total
avg = df['Age'].mean()
avg

26.25

In [24]:
total = df['Salary'].sum()
total

212000

In [26]:
#identifying maximum age and displaying the person name
max =df['Age'].max()
person_max =df.loc[df['Age'] == max , 'Name']
person_max

3    David
Name: Name, dtype: object

In [28]:
#sorting in asceding
ascending = df.sort_values(by ='Age')
ascending

      Name  Age         city  Salary
2  Charlie   22      Chicago   45000
0    Alice   24     New York   50000
1      bob   27  Los Angeles   65000
3    David   32      Houston   52000

In [30]:
descending = df.sort_values(by = 'Salary' , ascending = False)
descending

      Name  Age         city  Salary
1      bob   27  Los Angeles   65000
3    David   32      Houston   52000
0    Alice   24     New York   50000
2  Charlie   22      Chicago   45000

In [32]:
#grouping and aggregating
grp1 = df.groupby('city')['Age'].mean()
print(grp1)

city
Chicago        22.0
Houston        32.0
Los Angeles    27.0
New York       24.0
Name: Age, dtype: float64

In [34]:
grp2 = df.groupby('city')['Salary'].sum()
grp2

city
Chicago        45000
Houston        52000
Los Angeles    65000
New York       50000
Name: Salary, dtype: int64

In [36]:
new={'Name': 'john' , 'city' : 'New York'}
df.loc[len(df)] = new
df

      Name   Age         city   Salary
0    Alice  24.0     New York  50000.0
1      bob  27.0  Los Angeles  65000.0
2  Charlie  22.0      Chicago  45000.0
3    David  32.0      Houston  52000.0
4     john   NaN     New York      NaN

In [38]:
mean_age = df['Age'].mean()
df['Age'] = df['Age'].fillna(mean_age)
df

      Name    Age         city   Salary
0    Alice  24.00     New York  50000.0
1      bob  27.00  Los Angeles  65000.0
2  Charlie  22.00      Chicago  45000.0
3    David  32.00      Houston  52000.0
4     john  26.25     New York      NaN

In [40]:
df.dropna()

      Name   Age         city   Salary
0    Alice  24.0     New York  50000.0
1      bob  27.0  Los Angeles  65000.0
2  Charlie  22.0      Chicago  45000.0
3    David  32.0      Houston  52000.0

In [42]:
df.to_csv("task2.csv")

In [44]:
csv = pd.read_csv("task2.csv")
csv

   Unnamed: 0     Name    Age         city   Salary
0           0    Alice  24.00     New York  50000.0
1           1      bob  27.00  Los Angeles  65000.0
2           2  Charlie  22.00      Chicago  45000.0
3           3    David  32.00      Houston  52000.0
4           4     john  26.25     New York      NaN

In [46]:
df.set_index('Name')

           Age         city   Salary
Name
Alice    24.00     New York  50000.0
bob      27.00  Los Angeles  65000.0
Charlie  22.00      Chicago  45000.0
David    32.00      Houston  52000.0
john     26.25     New York      NaN

In [48]:
df.iloc[2]

Name      Charlie
Age          22.0
city      Chicago
Salary    45000.0
Name: 2, dtype: object

In [52]:
df['city'].unique()

array(['New York', 'Los Angeles', 'Chicago', 'Houston'], dtype=object)

In [62]:
df.rename(columns ={'Age':'age'})

      Name    age         city   Salary
0    Alice  24.00     New York  50000.0
1      bob  27.00  Los Angeles  65000.0
2  Charlie  22.00      Chicago  45000.0
3    David  32.00      Houston  52000.0
4     john  26.25     New York      NaN